export const fakeData = [
  {
    id: 1,
    category: 'ABOUT',
    list: [
      {
        id: '1a',
        title: '使用者經驗設計專題',
        no: 'ICT5373',
        type: '選修',
        credit: '學分數: 3',
        teacher: '李峻德',
        link: 'https://www.google.com',
        content: '<p>&nbsp;&nbsp;&nbsp;&nbsp;國立交通大學人機互動中心成立於 2017年12月，是全國第一個以人機互動（Human Computer Interaction，簡稱HCI）作為核心研究暨教學中心。由資訊學院、客家文化學院、管理學院人機互動領域相關專業學者與老師組成，結合各領域資源，專注於人機互動相關領域發展之研究機構，研究領域包括：資訊、傳播、心理、人因、設計、藝術、社會學。本中心之研究成果，能直接應用在設計及開發人性化的科技數位互動產品。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;本中心之研究主題分為九大項目：普及運算、智慧使用者介面、互動設計創新、群眾外包、電腦輔助溝通、VR/AR、使用者體驗，並在多位專家學者的努力下在各主題中皆有豐富之研究成果，於多個國際頂尖會議、期刊大放異彩。(Learn more)</p><p>&nbsp;&nbsp;&nbsp;&nbsp;本中心也同時致力於推廣針對未來科技趨勢及社會對使用者經驗的高度需求所設計的人機互動專業課程。完成 HCI 系列課程的學生能夠具備思辨、批判思考和深度探討問題的能力，學會把創意發想建構在「問題－解決」（Problem-Solution）的前提上，以更務實與邏輯的方法解決問題。本中心期待透過此系列課程培養出同時具有設計思考與研究批判能力的科技領袖，開發出符合使用者需求且同時改善人類生活、解決社會議題的數位科技。</p>'
      }
    ]
  }
]
