let album1 = require('assets/image/song1.png')
let album2 = require('assets/image/song2.png')
let album3 = require('assets/image/song3.png')

export const albumData = [
  {
    coverSrc: album1,
    title: 'With You',
    member: [
      '作詞/ 蘇立心 張宇辰 石育瑄 林憶君',
      '作曲/ 林憶君 蘇立心',
      '編曲/ 林憶君 蘇立心 石育瑄',
      '混音/ 林憶君 石育瑄',
      '主唱/ 施昱捷 許倩瑜 張宇辰',
      '合音/ 林憶君 蘇立心',
      '大合唱/ 王棋 林芳妤 程薰瑩 石育瑄'
    ],
    mention: [
      [
        '時間怎麼過的那麼快，感覺才剛進來又要畢業了。',
        '做過多少瘋狂的事，又有過多少的遺憾?',
        '交大的四年是我學生時期最難忘的四年，是否留下過什麼?',
        '是否忘記了什麼? 是否遺憾些什麼?',
        '這就是交大給我們最好的回憶。'
      ]
    ],
    lyrics: [
      [
        '[Verse/主歌]',
        '一提到交大校園階級',
        '就是學妹學長校狗學弟',
        '不要 走心',
        '請你看看路上男女比'
      ],
      [
        '一開學就在期待放假',
        'e3的作業待繳從沒停下',
        '期中 爆炸',
        '期末只好跪著求學霸'
      ],
      [
        '就這樣一年過了一年',
        '還是要揪團打lol吃吃宵夜',
        '別再 熬夜',
        '還要帶著肝進台積電'
      ],
      [
        '問自己四年有沒有變',
        '是否該帶一些回憶紀念',
        '浩然 過夜',
        '或是搭訕學妹逛校園'
      ],
      [
        '[Chorus/副歌]',
        '從交大畢業',
        '往夢想起飛',
        '路途再遙遠',
        '我還有你陪'
      ],
      [
        '回首這四年',
        '有歡笑淚水',
        '別害怕離別',
        '要勇往直前'
      ],
      [
        '[Rap]',
        '記得剛上大一心裡有多少憧憬',
        '只看名字選課也不管教授鬆緊',
        '想像自己要看遍 所有的風景',
        '明天微積分會考哦 那是什麼東西'
      ],
      [
        '暑假辦過的營隊 努力不是為了名位',
        '這過程 有笑有淚 有high有醉',
        '有過台下的掌聲  也有過爭吵的心碎',
        '多少風風雨雨 我們都一起面對'
      ],
      [
        '難道長大就是痛苦 沒人理解的痛楚',
        '只想要 爬到高處 新的高度 不想跌回低谷',
        '曾經的homie 都不在 只有自己能依賴',
        '別想要 沒有準備 就去應對 不是每次都能靠賽'
      ],
      [
        '種種回憶如此寶貴 追夢的心不曾倒退',
        '希望到了以後 還能保持原有的純粹',
        '面對未來不會再慫 無理的要求不再聽從',
        '曾經我以交大為榮 畢業後交大以我為榮'
      ],
      [
        '[Chorus/副歌]',
        '從交大畢業 (It’s time to graduate)',
        '往夢想起飛 (Find your own way)',
        '路途再遙遠 (Please don’t be afraid)',
        '我還有你陪 (That’s needless to say)'
      ],
      [
        '回首這四年 (想要對你說的話）',
        '有歡笑淚水 (全部放在心裏底）',
        '別害怕離別 (有我跟你黏作伙）',
        '要勇往直前 (不管困難有多少）'
      ],
      [
        '[Bridge]',
        '傳情我都傳給自己當作安慰',
        '室友不但死會還可以拿卷',
        '但還好我還有一群好同學',
        '可以陪我一起魯一起耍廢'
      ],
      [
        '[Chorus/副歌]',
        '從交大畢業',
        '往夢想起飛',
        '路途再遙遠',
        '我還有你陪'
      ],
      [
        '回首這四年',
        '有歡笑淚水',
        '別害怕離別',
        '要勇往直前'
      ],
      [
        '[大合唱]',
        '從交大畢業',
        '往夢想起飛',
        '路途再遙遠',
        '我還有你陪'
      ],
      [
        '回首這四年',
        '有歡笑淚水',
        '別害怕離別',
        '要勇往直前'
      ]
    ]
  },
  {
    coverSrc: album2,
    title: '我們',
    member: [
      '演唱：麥喬登、王沛軒',
      '作詞：王沛軒',
      '作曲：尤士豪、王沛軒',
      '編曲：段定語、魏柏全、沈冠辰、吳竣宇',
      '混音：段定語'
    ],
    mention: [
      [
        '時間快得超乎想像，但幸好我們有趕上彼此年輕的時候。',
        '曾經一起翹課打遊戲、熬夜趕作業、辦營隊看日出，在對方的記憶裡悄悄留下痕跡。',
        '我們裡有你、有我、有他，還有很多待完成的夢想，',
        '離別暫時還不是一件悲傷的事！'
      ]
    ],
    lyrics: [
      [
        '[Verse1/主歌1]',
        '不習慣說晚安 因為害怕離別',
        '也不喜歡道別 如果轉眼就消失不見'
      ],
      [
        '有時候脆弱 想逃避這一切',
        '更多的時候 不願坦然面對',
        '（有時候脆弱 想逃避這一切）'
      ],
      [
        '[Chorus/副歌]',
        '還沒準備好那樣的心情',
        '到那樣的地方去',
        '但我們終將從青春離去'
      ],
      [
        '那夜在操場的星空下',
        '用一把吉他 大聲唱著歌啊',
        '（唱我們的歌啊）',
        '酒精催化下　笑意的臉龐',
        '有你 和我 和他'
      ],
      [
        '在南寮岸邊的海浪拍打',
        '淺灘上我們追著暖陽跑啊',
        '無論未來　還有多遙遠',
        '一起將 青春 走遍',
        '（有你 和我 和他）'
      ],
      [
        '[Verse2/主歌]',
        '窗外的光透亮　 倒數鐘聲擺盪',
        '在回憶前敲響　多少一起看日出的夜'
      ],
      [
        '氤氳的歲月　飄忽在田野間',
        '輕輕將思念 收藏　然後說再見',
        '（輕輕的想念　期待下次說再見）'
      ],
      [
        '[Chorus/副歌]',
        '還沒準備好那樣的心情',
        '到那樣的地方去',
        '但我們終將從青春離去'
      ],
      [
        '那夜在操場的星空下',
        '用一把吉他 大聲唱著歌啊（唱我們的歌啊）',
        '酒精催化下　笑意的臉龐',
        '有你 和我 和他'
      ],
      [
        '在南寮岸邊的海浪拍打',
        '淺灘上我們追著暖陽跑啊',
        '無論未來　還有多遙遠',
        '一起將 青春 走遍',
        '（有你 和我 和他）'
      ],
      [
        '我們在那年 唱著學校',
        '被期末報告追著跑',
        '我們都說自己不會老',
        '因為還有很多要完成的夢啊',
        '（有你 和我 和他）'
      ]
    ]
  },
  {
    coverSrc: album3,
    title: '說好再見',
    member: [
      '詞曲：傅嘉修、陳昱鈞',
      '編曲：傅嘉修、陳昱鈞'
    ],
    mention: [
      [
        '在午後的校園中，木吉他刷著和弦，溫暖的唱著，屬於我們回憶的歌。',
        '記得總是等待下課鐘響，期待中午要吃甚麼，與朋友們說說笑笑的日常生活；',
        '記得雖然看似迷惘徬徨，說到夢想，卻能看見心中發光發熱的靈魂。',
        '畢業後雖將離開交大，到更遠的遠方冒險，無論是否還能有你的陪伴，',
        '當離夢想又更近了些，我們說好還要再見。'
      ]
    ],
    lyrics: [
      [
        '窗外的笑聲 喚醒我',
        '在午後時光',
        '下課的鐘聲 還沒響'
      ],
      [
        '想像著待會 吃甚麼',
        '去哪個地方',
        '耳邊傳來 你說的話'
      ],
      [
        '在離開之前 我聽著',
        '你說的夢想',
        '現在就要啟程流浪'
      ],
      [
        '到未來之前 我想像',
        '要去向遠方',
        '而你在哪 也徬徨嗎'
      ],
      [
        '而我在想 能不能留下',
        '想知道那一天 是誰 把故事說完啦',
        '你的手上 還抱著吉他',
        '把回憶寫成歌 邊唱 一邊往前走吧'
      ],
      [
        '[副歌]',
        '看今天 會有誰',
        '能陪你去冒險',
        '緊握住的從前 還沒走遠'
      ],
      [
        '到明天 成為誰',
        '所有的夢都已沈睡',
        '說好 再見 不能反悔'
      ],
      [
        '看今天 會有誰',
        '能陪我去冒險',
        '緊握住的從前 不想走遠'
      ],
      [
        '一直到明天 成為誰',
        '所有的夢都已實現',
        '說好 再見 不能反悔'
      ]
    ]
  }
]
