let album1 = require('assets/image/b1.png')
let album2 = require('assets/image/b2.jpg')
let album3 = require('assets/image/b3.jpg')
let album4 = require('assets/image/b4.jpg')

export const albumData = [
  {
    coverSrc: album1,
    title: 'With You',
    member: [
      '作詞/ 蘇立心 張宇辰 石育瑄 林憶君',
      '作曲/ 林憶君 蘇立心',
      '編曲/ 林憶君 蘇立心 石育瑄',
      '混音/ 林憶君 石育瑄',
      '主唱/ 施昱捷 許倩瑜 張宇辰',
      '合音/ 林憶君 蘇立心',
      '大合唱/ 王棋 林芳妤 程薰瑩 石育瑄'
    ],
    mention: [
      [
        '時間怎麼過的那麼快，感覺才剛進來又要畢業了。',
        '做過多少瘋狂的事，又有過多少的遺憾?',
        '交大的四年是我學生時期最難忘的四年，是否留下過什麼?',
        '是否忘記了什麼? 是否遺憾些什麼?',
        '這就是交大給我們最好的回憶。'
      ]
    ],
    lyrics: [
      [
        '[Verse/主歌]',
        '一提到交大校園階級',
        '就是學妹學長校狗學弟',
        '不要 走心',
        '請你看看路上男女比',
        '一開學就在期待放假',
        'e3的作業待繳從沒停下',
        '期中 爆炸',
        '期末只好跪著求學霸',
        '就這樣一年過了一年',
        '還是要揪團打lol吃吃宵夜',
        '別再 熬夜',
        '還要帶著肝進台積電',
        '問自己四年有沒有變',
        '是否該帶一些回憶紀念',
        '浩然 過夜',
        '或是搭訕學妹逛校園'
      ],
      [
        '[Chorus/副歌]',
        '從交大畢業',
        '往夢想起飛',
        '路途再遙遠',
        '我還有你陪',
        '回首這四年',
        '有歡笑淚水',
        '別害怕離別',
        '要勇往直前'
      ],
      [
        '[Rap]',
        '記得剛上大一心裡有多少憧憬',
        '只看名字選課也不管教授鬆緊',
        '想像自己要看遍 所有的風景',
        '明天微積分會考哦 那是什麼東西',
        '暑假辦過的營隊 努力不是為了名位',
        '這過程 有笑有淚 有high有醉',
        '有過台下的掌聲  也有過爭吵的心碎',
        '多少風風雨雨 我們都一起面對',
        '難道長大就是痛苦 沒人理解的痛楚',
        '只想要 爬到高處 新的高度 不想跌回低谷',
        '曾經的homie 都不在 只有自己能依賴',
        '別想要 沒有準備 就去應對 不是每次都能靠賽',
        '種種回憶如此寶貴 追夢的心不曾倒退',
        '希望到了以後 還能保持原有的純粹',
        '面對未來不會再慫 無理的要求不再聽從',
        '曾經我以交大為榮 畢業後交大以我為榮'
      ],
      [
        '[Chorus/副歌]',
        '從交大畢業 (It’s time to graduate)',
        '往夢想起飛 (Find your own way)',
        '路途再遙遠 (Please don’t be afraid)',
        '我還有你陪 (That’s needless to say)',
        '回首這四年 (想要對你說的話）',
        '有歡笑淚水 (全部放在心裏底）',
        '別害怕離別 (有我跟你黏作伙）',
        '要勇往直前 (不管困難有多少）'
      ],
      [
        '[Bridge]',
        '傳情我都傳給自己當作安慰',
        '室友不但死會還可以拿卷',
        '但還好我還有一群好同學',
        '可以陪我一起魯一起耍廢'
      ],
      [
        '[Chorus/副歌]',
        '從交大畢業',
        '往夢想起飛',
        '路途再遙遠',
        '我還有你陪',
        '回首這四年',
        '有歡笑淚水',
        '別害怕離別',
        '要勇往直前'
      ],
      [
        '[大合唱]',
        '從交大畢業',
        '往夢想起飛',
        '路途再遙遠',
        '我還有你陪',
        '回首這四年',
        '有歡笑淚水',
        '別害怕離別',
        '要勇往直前'
      ]
    ]
  },
  {
    coverSrc: album2,
    title: 'LOS HERALDOS NEGROS',
    group: 'Mayte Alvarado'
  },
  {
    coverSrc: album3,
    title: 'Forest',
    group: 'Arun Mehmi'
  },
  {
    coverSrc: album4,
    title: 'Forest',
    group: 'Arun Mehmi'
  }
]
